uhnp/src/Reports/ПоследовательностиУчастия/ПоследовательностиУчастия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПоследовательностиУчастия</name>
</mdclass:Report>

uhnp/src/InformationRegisters/СтатусыОбъектовИнвестирования/СтатусыОбъектовИнвестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбъектовИнвестирования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОтношениеКГруппе</name>
    <type>
      <types>CatalogRef.ГруппыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЭффективнаяДоля</name>
    <type>
      <types>DefinedType.ДоляВладенияНеотрицательное</types>
    </type>
  </resources>
  <resources>
    <name>ЦепочкаПАО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПоследовательностиУчастия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/ДвижениеИнвестиций/ДвижениеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеИнвестиций</name>
  <resources>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрямаяДоляВладения</name>
    <type>
      <types>DefinedType.ДоляВладения</types>
    </type>
  </resources>
  <resources>
    <name>БалансоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Reports/ПоследовательностиУчастия/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПодготовитьРезультат(ДокументРезультат, ДанныеРасшифровки);

КонецПроцедуры

Процедура ЗаполнитьПоОтбору(Сценарий, ДатаСреза, Инвестор = Неопределено, ОбъектИнвестирования = Неопределено) Экспорт
	
	НастройкиОтчета = Новый Структура("ОтчетСсылка", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ЭтотОбъект.Метаданные())); // ошибка ЕРПУХ
	ФормаПараметры = Новый Структура("Отбор", Новый Массив); // ошибка ЕРПУХ
	КонтекстФормы = Новый Структура("Элементы, НастройкиОтчета, ФормаПараметры", Новый Массив, НастройкиОтчета, ФормаПараметры); 
	ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(КонтекстФормы, КомпоновщикНастроек.Настройки);//заполним оформление по умолчанию
	
	ТиповыеОтчетыУХ.ПолучитьПараметр(КомпоновщикНастроек, "Сценарий").Значение = Сценарий;
	ТиповыеОтчетыУХ.ПолучитьПараметр(КомпоновщикНастроек, "Дата").Значение = ДатаСреза;
	
	Отборы = Новый Структура("Инвестор, ОбъектИнвестирования", Инвестор, ОбъектИнвестирования);
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	Для каждого ТекущийОтбор Из Отборы Цикл
		
		Если Не ЗначениеЗаполнено(ТекущийОтбор.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Отборы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(КомпоновщикНастроек.Настройки.Отбор, "Инвестор");
		Для каждого ЭлементОтбора Из Отборы Цикл
			
			ЭлементОтбораПН = ТиповыеОтчетыУХ.ПолучитьПользовательскуюНастройку(ЭлементОтбора, ПользовательскиеНастройки);
			Если ТипЗнч(ТекущийОтбор.Значение) = Тип("СправочникСсылка.Организации") Тогда
				ЭлементОтбораПН.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Иначе 
				ЭлементОтбораПН.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			КонецЕсли;			
			ЭлементОтбораПН.ПравоеЗначение = ТекущийОтбор.Значение;
			ЭлементОтбораПН.Использование = Истина;
			
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьРезультат(Результат, ДанныеРасшифровки = Неопределено) Экспорт

	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
		
	ВнешниеНД = Новый Структура("ПоследовательностиУчастия", ПолучитьПоследовательности(НастройкиСКД));
	Результат = ТиповыеОтчетыУХ.ПолучитьКоллекциюРезультат(СхемаКомпоновкиДанных, НастройкиСКД, ВнешниеНД, 
																	 , , , , Результат);	
	
КонецПроцедуры

#Область ПодготовитьРезультат

Функция ПользовательскаяНастройка(ПользовательскиеНастройки, ЭлементНастроек)

	Если Не ЗначениеЗаполнено(ЭлементНастроек.ИдентификаторПользовательскойНастройки) Тогда		
		Возврат Неопределено; 
	КонецЕсли;
	
	Возврат ПользовательскиеНастройки.Элементы.Найти(ЭлементНастроек.ИдентификаторПользовательскойНастройки);
	
КонецФункции

Функция ПолучитьПоследовательности(НастройкиСКД)
		
	Построитель = Новый ПостроительЗапроса(ТекстЗапроса_Статусы());
	Построитель.ЗаполнитьНастройки();
	
	ДобавитьОтборы(Построитель, НастройкиСКД, "Инвестор");
	ДобавитьОтборы(Построитель, НастройкиСКД, "ОбъектИнвестирования");
	
	Запрос = Построитель.ПолучитьЗапрос();
	
	Запрос.Текст 
	= СтрЗаменить(СтрЗаменить(Запрос.Текст, "ИЗ", "ПОМЕСТИТЬ втСтатусы ИЗ"), "ВЫБРАТЬ", "ВЫБРАТЬ АВТОНОМЕРЗАПИСИ() КАК НомерСтатуса,") 
	+ " ИНДЕКСИРОВАТЬ ПО НомерСтатуса " 
	+ " ; " 
	+ ТекстЗапроса_НомераСтатусы();
	
	ПериодСреза = ТиповыеОтчетыУХ.ПолучитьПараметр(КомпоновщикНастроек, "Дата").Значение;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сценарий",		ТиповыеОтчетыУХ.ПолучитьПараметр(КомпоновщикНастроек, "Сценарий").Значение);
	Запрос.УстановитьПараметр("ПериодСреза",	?(ТипЗнч(ПериодСреза) = Тип("СтандартнаяДатаНачала"), ПериодСреза.Дата, ПериодСреза));
	Запрос.УстановитьПараметр("ДатаСреза",		МСФОВызовСервераУХ.ПолучитьДатуИзПериода(ПериодСреза));
	
	ПоследовательностиУчастия = ПолучитьОписаниеПоследовательности(); 
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		текПоследовательности = Выборка.ПоследовательностиУчастия.Получить();
		
		Для каждого п Из текПоследовательности Цикл			
			Для каждого эл Из п.Значение.Последовательность Цикл
				
				СтрокаТаб = ПоследовательностиУчастия.Добавить();				
				ЗаполнитьЗначенияСвойств(СтрокаТаб, эл);
				СтрокаТаб.НомерСтатуса 						= Выборка.НомерСтатуса;
				СтрокаТаб.НомерПоследовательностиУчастия 	= п.Значение.НомерПоследовательности;				
				
			КонецЦикла;		
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПоследовательностиУчастия", ПоследовательностиУчастия);
	Запрос.Текст = ТекстЗапроса_Последовательности();
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция ТекстЗапроса_Статусы()

	Возврат
	"ВЫБРАТЬ
	|	Статусы.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	Статусы.Инвестор КАК Инвестор,
	|	Статусы.Сценарий КАК Сценарий,
	|	Статусы.ОтношениеКГруппе КАК ОтношениеКГруппе,
	|	Статусы.ЭффективнаяДоля КАК ЭффективнаяДоля,
	|	Статусы.ЦепочкаПАО КАК ЦепочкаПАО,
	|	Статусы.ПоследовательностиУчастия КАК ПоследовательностиУчастия,
	|	Статусы.Регистратор КАК Регистратор,
	|	Статусы.Период КАК Дата
	|ИЗ
	|	РегистрСведений.СтатусыОбъектовИнвестирования.СрезПоследних(&ПериодСреза, Сценарий = &Сценарий {(Инвестор).* КАК Инвестор, (ОбъектИнвестирования).* КАК ОбъектИнвестирования}) КАК Статусы";

КонецФункции

Функция ТекстЗапроса_НомераСтатусы()

	Возврат
	"ВЫБРАТЬ
	|	втСтатусы.НомерСтатуса КАК НомерСтатуса,
	|	втСтатусы.ПоследовательностиУчастия КАК ПоследовательностиУчастия
	|ИЗ
	|	втСтатусы КАК втСтатусы";

КонецФункции

Функция ТекстЗапроса_Последовательности()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	т.НомерСтатуса КАК НомерСтатуса,
	|	т.НомерПоследовательностиУчастия КАК НомерПоследовательности,
	|	т.Номер КАК Номер,
	|	т.ИнвесторПоследовательности КАК ИнвесторПоследовательности,
	|	т.ОбъектИнвестированияПоследовательности КАК ОбъектИнвестированияПоследовательности,
	|	т.ЭффективнаяДоля КАК ЭффективнаяДоля,
	|	т.ПрямаяДоля КАК ПрямаяДоля
	|ПОМЕСТИТЬ втПоследовательности
	|ИЗ
	|	&ПоследовательностиУчастия КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтатуса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Инвестор КАК Инвестор,
	|	т.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	т.ПрямаяДоляВладенияОборот КАК ПрямаяДоля
	|ПОМЕСТИТЬ втПрямыеДоли
	|ИЗ
	|	РегистрНакопления.ДвижениеИнвестиций.Обороты(
	|			,
	|			&ПериодСреза,
	|			,
	|			Сценарий = &Сценарий
	|				И ОбъектИнвестирования В
	|					(ВЫБРАТЬ
	|						т.ОбъектИнвестирования
	|					ИЗ
	|						втСтатусы КАК т)) КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Инвестор,
	|	ОбъектИнвестирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСтатусы.Регистратор КАК Регистратор,
	|	втСтатусы.Дата КАК Период,
	|	втСтатусы.Инвестор КАК Инвестор,
	|	втСтатусы.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	т.НомерСтатуса КАК НомерСтатуса,
	|	ЕСТЬNULL(т.НомерПоследовательности, 1) КАК НомерПоследовательностиУчастия,
	|	ЕСТЬNULL(т.Номер, 1) КАК Номер,
	|	ЕСТЬNULL(т.ИнвесторПоследовательности, втСтатусы.Инвестор) КАК ИнвесторПоследовательности,
	|	ЕСТЬNULL(т.ОбъектИнвестированияПоследовательности, втСтатусы.ОбъектИнвестирования) КАК ОбъектИнвестированияПоследовательности,
	|	ЕСТЬNULL(втПрямыеДоли.ПрямаяДоля, 0) КАК ПрямаяДоля,
	|	ЕСТЬNULL(т.ЭффективнаяДоля, втСтатусы.ЭффективнаяДоля) КАК ЭффективнаяДоля,
	|	втСтатусы.ОтношениеКГруппе КАК ОтношениеКГруппе,
	|	втСтатусы.ЦепочкаПАО КАК ЦепочкаПАО,
	|	&СтатусКИК КАК СтатусИностраннойКомпании
	|ИЗ
	|	втСтатусы КАК втСтатусы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПоследовательности КАК т
	|		ПО (т.НомерСтатуса = втСтатусы.НомерСтатуса)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПрямыеДоли КАК втПрямыеДоли
	|		ПО (ЕСТЬNULL(т.ИнвесторПоследовательности, втСтатусы.Инвестор) = втПрямыеДоли.Инвестор)
	|			И (ЕСТЬNULL(т.ОбъектИнвестированияПоследовательности, втСтатусы.ОбъектИнвестирования) = втПрямыеДоли.ОбъектИнвестирования)";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ИнтеграцияКИК") Тогда
		
		МодульКИК = ОбщегоНазначения.ОбщийМодуль("РасчетыПоКорпоративнымНалогам");
		МодульКИК.ПодставитьСтатусИК(ТекстЗапроса, "втСтатусы", "ДатаСреза");
		
	Иначе //нет КИК
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтатусКИК", "втСтатусы.ОтношениеКГруппе");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьОписаниеПоследовательности()

	Таб = Новый ТаблицаЗначений;
	
	Таб.Колонки.Добавить("НомерСтатуса", Новый ОписаниеТипов("Число"));
	
	Таб.Колонки.Добавить("Инвестор", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таб.Колонки.Добавить("ОбъектИнвестирования", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Таб.Колонки.Добавить("НомерПоследовательностиУчастия", Новый ОписаниеТипов("Число"));
	Таб.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));
	
	Таб.Колонки.Добавить("ИнвесторПоследовательности", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таб.Колонки.Добавить("ОбъектИнвестированияПоследовательности", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Таб.Колонки.Добавить("ПрямаяДоля", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(18,15));
	Таб.Колонки.Добавить("ЭффективнаяДоля", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(18,15));
	Таб.Колонки.Добавить("ОтношениеКГруппе", Новый ОписаниеТипов("СправочникСсылка.ГруппыКонтрагентов"));
	
	Если Метаданные.Перечисления.Найти("СтатусыИностранныхКомпаний") <> Неопределено Тогда
		Таб.Колонки.Добавить("СтатусИностраннойКомпании", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыИностранныхКомпаний"));
	Иначе	
		Таб.Колонки.Добавить("СтатусИностраннойКомпании", Новый ОписаниеТипов("СправочникСсылка.ГруппыКонтрагентов"));
	КонецЕсли;
	
	//
	//Инвестор
	//ОбъектИнвестирования
	//НомерПоследовательностиУчастия
	//Номер
	//ИнвесторПоследовательности
	//ОбъектИнвестированияПоследовательности
	//ПрямаяДоля
	//ЭффективнаяДоля
	//ОтношениеКГруппе
	//СтатусИностраннойКомпании

	Возврат Таб;

КонецФункции

Функция ДобавитьОтборы(Построитель, НастройкиСКД, ПолеОтбора = "Инвестор")

	ПоляОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиСКД.Отбор, ПолеОтбора);
	
	Для каждого ЭлементОтбора Из ПоляОтбора Цикл
		
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Построитель.Отбор.Добавить(ПолеОтбора);
		Отбор.ВидСравнения = ВидСравненияПостроителя(ЭлементОтбора.ВидСравнения);
		Отбор.Значение = ЭлементОтбора.ПравоеЗначение;
		
	КонецЦикла;

КонецФункции

Функция ВидСравненияПостроителя(ВидСравненияСКД)

	Если ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно Тогда
		Возврат ВидСравнения.Равно;
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		Возврат ВидСравнения.ВСписке;
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		Возврат ВидСравнения.НеРавно;
	ИначеЕсли ВидСравненияСКД = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		Возврат ВидСравнения.НеВСписке;
	Иначе 
		Возврат ВидСравнения.Равно;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
